---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailCurveTooShort
source: html/ff77a238-9c2d-2651-8c01-f81a15ab74de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailCurveTooShort Property

Curve in rail sketch is too short for rail creation and ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailCurveTooShort { get; }
```